// pages/SubscribeList/SubscribeList.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [{
      name1: '叁門堂',
      time1: '2020-09-24 12:00',
      time2: '2020-09-24 13:30',
      name2: '琴景胜',
      time3: '2020-09-23 18:17',
      ob1:'取消订单',
      ob2:'详情'
    }, {
      name1: '叁門堂',
      time1: '2020-09-21 12:00',
      time2: '2020-09-21 13:30',
      name2: '琴景胜',
      time3: '2020-09-21 18:17',
      ob1:'取消订单',
      ob2:'详情'
    }, {
      name1: '叁門堂',
      time1: '2020-09-21 12:00',
      time2: '2020-09-21 13:30',
      name2: '琴景胜',
      time3: '2020-09-21 18:17',
      ob1:'已结束',
      ob2:'详情'
    }, {
      name1: '叁門堂',
      time1: '2020-09-14 12:00',
      time2: '2020-09-14 13:30',
      name2: '琴景胜',
      time3: '2020-09-14 18:17',
      ob1:'已结束',
      ob2:'详情'
    }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

go(){
  wx.navigateTo({
    url: '../Appin/Appin',
  })
}
})